{
  "irVersion": "7",
  "producerName": "skl2onnx",
  "producerVersion": "1.10.0",
  "domain": "ai.onnx",
  "modelVersion": "0",
  "docString": "",
  "graph": {
    "node": [
      {
        "input": [
          "X",
          "comb1"
        ],
        "output": [
          "col1"
        ],
        "name": "ArrayFeatureExtractor1",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb2"
        ],
        "output": [
          "col2"
        ],
        "name": "ArrayFeatureExtractor2",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb5"
        ],
        "output": [
          "col5"
        ],
        "name": "ArrayFeatureExtractor5",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb3"
        ],
        "output": [
          "col3"
        ],
        "name": "ArrayFeatureExtractor3",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb4"
        ],
        "output": [
          "col4"
        ],
        "name": "ArrayFeatureExtractor4",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb6"
        ],
        "output": [
          "col6"
        ],
        "name": "ArrayFeatureExtractor6",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb10"
        ],
        "output": [
          "col10"
        ],
        "name": "ArrayFeatureExtractor10",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb9"
        ],
        "output": [
          "col9"
        ],
        "name": "ArrayFeatureExtractor9",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb8"
        ],
        "output": [
          "col8"
        ],
        "name": "ArrayFeatureExtractor8",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb7"
        ],
        "output": [
          "col7"
        ],
        "name": "ArrayFeatureExtractor7",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb11"
        ],
        "output": [
          "col11"
        ],
        "name": "ArrayFeatureExtractor11",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb12"
        ],
        "output": [
          "col12"
        ],
        "name": "ArrayFeatureExtractor12",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb13"
        ],
        "output": [
          "col13"
        ],
        "name": "ArrayFeatureExtractor13",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb14"
        ],
        "output": [
          "col14"
        ],
        "name": "ArrayFeatureExtractor14",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb15"
        ],
        "output": [
          "col15"
        ],
        "name": "ArrayFeatureExtractor15",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb16"
        ],
        "output": [
          "col16"
        ],
        "name": "ArrayFeatureExtractor16",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb17"
        ],
        "output": [
          "col17"
        ],
        "name": "ArrayFeatureExtractor17",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb"
        ],
        "output": [
          "col"
        ],
        "name": "ArrayFeatureExtractor",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb60"
        ],
        "output": [
          "col60"
        ],
        "name": "ArrayFeatureExtractor60",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb61"
        ],
        "output": [
          "col61"
        ],
        "name": "ArrayFeatureExtractor61",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb62"
        ],
        "output": [
          "col62"
        ],
        "name": "ArrayFeatureExtractor62",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb63"
        ],
        "output": [
          "col63"
        ],
        "name": "ArrayFeatureExtractor63",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb64"
        ],
        "output": [
          "col64"
        ],
        "name": "ArrayFeatureExtractor64",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb46"
        ],
        "output": [
          "col46"
        ],
        "name": "ArrayFeatureExtractor46",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb47"
        ],
        "output": [
          "col47"
        ],
        "name": "ArrayFeatureExtractor47",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb48"
        ],
        "output": [
          "col48"
        ],
        "name": "ArrayFeatureExtractor48",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb49"
        ],
        "output": [
          "col49"
        ],
        "name": "ArrayFeatureExtractor49",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb50"
        ],
        "output": [
          "col50"
        ],
        "name": "ArrayFeatureExtractor50",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb51"
        ],
        "output": [
          "col51"
        ],
        "name": "ArrayFeatureExtractor51",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb52"
        ],
        "output": [
          "col52"
        ],
        "name": "ArrayFeatureExtractor52",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb53"
        ],
        "output": [
          "col53"
        ],
        "name": "ArrayFeatureExtractor53",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb54"
        ],
        "output": [
          "col54"
        ],
        "name": "ArrayFeatureExtractor54",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb55"
        ],
        "output": [
          "col55"
        ],
        "name": "ArrayFeatureExtractor55",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb56"
        ],
        "output": [
          "col56"
        ],
        "name": "ArrayFeatureExtractor56",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb57"
        ],
        "output": [
          "col57"
        ],
        "name": "ArrayFeatureExtractor57",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb58"
        ],
        "output": [
          "col58"
        ],
        "name": "ArrayFeatureExtractor58",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb59"
        ],
        "output": [
          "col59"
        ],
        "name": "ArrayFeatureExtractor59",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb32"
        ],
        "output": [
          "col32"
        ],
        "name": "ArrayFeatureExtractor32",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb33"
        ],
        "output": [
          "col33"
        ],
        "name": "ArrayFeatureExtractor33",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb34"
        ],
        "output": [
          "col34"
        ],
        "name": "ArrayFeatureExtractor34",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb35"
        ],
        "output": [
          "col35"
        ],
        "name": "ArrayFeatureExtractor35",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb36"
        ],
        "output": [
          "col36"
        ],
        "name": "ArrayFeatureExtractor36",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb37"
        ],
        "output": [
          "col37"
        ],
        "name": "ArrayFeatureExtractor37",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb38"
        ],
        "output": [
          "col38"
        ],
        "name": "ArrayFeatureExtractor38",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb39"
        ],
        "output": [
          "col39"
        ],
        "name": "ArrayFeatureExtractor39",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb40"
        ],
        "output": [
          "col40"
        ],
        "name": "ArrayFeatureExtractor40",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb41"
        ],
        "output": [
          "col41"
        ],
        "name": "ArrayFeatureExtractor41",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb42"
        ],
        "output": [
          "col42"
        ],
        "name": "ArrayFeatureExtractor42",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb43"
        ],
        "output": [
          "col43"
        ],
        "name": "ArrayFeatureExtractor43",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb44"
        ],
        "output": [
          "col44"
        ],
        "name": "ArrayFeatureExtractor44",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb45"
        ],
        "output": [
          "col45"
        ],
        "name": "ArrayFeatureExtractor45",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb18"
        ],
        "output": [
          "col18"
        ],
        "name": "ArrayFeatureExtractor18",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb19"
        ],
        "output": [
          "col19"
        ],
        "name": "ArrayFeatureExtractor19",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb20"
        ],
        "output": [
          "col20"
        ],
        "name": "ArrayFeatureExtractor20",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb21"
        ],
        "output": [
          "col21"
        ],
        "name": "ArrayFeatureExtractor21",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb22"
        ],
        "output": [
          "col22"
        ],
        "name": "ArrayFeatureExtractor22",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb23"
        ],
        "output": [
          "col23"
        ],
        "name": "ArrayFeatureExtractor23",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb24"
        ],
        "output": [
          "col24"
        ],
        "name": "ArrayFeatureExtractor24",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb25"
        ],
        "output": [
          "col25"
        ],
        "name": "ArrayFeatureExtractor25",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb26"
        ],
        "output": [
          "col26"
        ],
        "name": "ArrayFeatureExtractor26",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb27"
        ],
        "output": [
          "col27"
        ],
        "name": "ArrayFeatureExtractor27",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb28"
        ],
        "output": [
          "col28"
        ],
        "name": "ArrayFeatureExtractor28",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb29"
        ],
        "output": [
          "col29"
        ],
        "name": "ArrayFeatureExtractor29",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb30"
        ],
        "output": [
          "col30"
        ],
        "name": "ArrayFeatureExtractor30",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "X",
          "comb31"
        ],
        "output": [
          "col31"
        ],
        "name": "ArrayFeatureExtractor31",
        "opType": "ArrayFeatureExtractor",
        "domain": "ai.onnx.ml"
      },
      {
        "input": [
          "col1"
        ],
        "output": [
          "prod1"
        ],
        "name": "ReduceProd1",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col4"
        ],
        "output": [
          "prod4"
        ],
        "name": "ReduceProd4",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col2"
        ],
        "output": [
          "prod2"
        ],
        "name": "ReduceProd2",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col3"
        ],
        "output": [
          "prod3"
        ],
        "name": "ReduceProd3",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col5"
        ],
        "output": [
          "prod5"
        ],
        "name": "ReduceProd5",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col6"
        ],
        "output": [
          "prod6"
        ],
        "name": "ReduceProd6",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col10"
        ],
        "output": [
          "prod10"
        ],
        "name": "ReduceProd10",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col7"
        ],
        "output": [
          "prod7"
        ],
        "name": "ReduceProd7",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col8"
        ],
        "output": [
          "prod8"
        ],
        "name": "ReduceProd8",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col9"
        ],
        "output": [
          "prod9"
        ],
        "name": "ReduceProd9",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col11"
        ],
        "output": [
          "prod11"
        ],
        "name": "ReduceProd11",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col12"
        ],
        "output": [
          "prod12"
        ],
        "name": "ReduceProd12",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col13"
        ],
        "output": [
          "prod13"
        ],
        "name": "ReduceProd13",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col14"
        ],
        "output": [
          "prod14"
        ],
        "name": "ReduceProd14",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col15"
        ],
        "output": [
          "prod15"
        ],
        "name": "ReduceProd15",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col16"
        ],
        "output": [
          "prod16"
        ],
        "name": "ReduceProd16",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col"
        ],
        "output": [
          "prod"
        ],
        "name": "ReduceProd",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col59"
        ],
        "output": [
          "prod59"
        ],
        "name": "ReduceProd59",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col60"
        ],
        "output": [
          "prod60"
        ],
        "name": "ReduceProd60",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col61"
        ],
        "output": [
          "prod61"
        ],
        "name": "ReduceProd61",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col62"
        ],
        "output": [
          "prod62"
        ],
        "name": "ReduceProd62",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col63"
        ],
        "output": [
          "prod63"
        ],
        "name": "ReduceProd63",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col64"
        ],
        "output": [
          "prod64"
        ],
        "name": "ReduceProd64",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col45"
        ],
        "output": [
          "prod45"
        ],
        "name": "ReduceProd45",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col46"
        ],
        "output": [
          "prod46"
        ],
        "name": "ReduceProd46",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col47"
        ],
        "output": [
          "prod47"
        ],
        "name": "ReduceProd47",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col48"
        ],
        "output": [
          "prod48"
        ],
        "name": "ReduceProd48",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col49"
        ],
        "output": [
          "prod49"
        ],
        "name": "ReduceProd49",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col50"
        ],
        "output": [
          "prod50"
        ],
        "name": "ReduceProd50",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col51"
        ],
        "output": [
          "prod51"
        ],
        "name": "ReduceProd51",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col52"
        ],
        "output": [
          "prod52"
        ],
        "name": "ReduceProd52",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col53"
        ],
        "output": [
          "prod53"
        ],
        "name": "ReduceProd53",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col54"
        ],
        "output": [
          "prod54"
        ],
        "name": "ReduceProd54",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col55"
        ],
        "output": [
          "prod55"
        ],
        "name": "ReduceProd55",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col56"
        ],
        "output": [
          "prod56"
        ],
        "name": "ReduceProd56",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col57"
        ],
        "output": [
          "prod57"
        ],
        "name": "ReduceProd57",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col58"
        ],
        "output": [
          "prod58"
        ],
        "name": "ReduceProd58",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col31"
        ],
        "output": [
          "prod31"
        ],
        "name": "ReduceProd31",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col32"
        ],
        "output": [
          "prod32"
        ],
        "name": "ReduceProd32",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col33"
        ],
        "output": [
          "prod33"
        ],
        "name": "ReduceProd33",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col34"
        ],
        "output": [
          "prod34"
        ],
        "name": "ReduceProd34",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col35"
        ],
        "output": [
          "prod35"
        ],
        "name": "ReduceProd35",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col36"
        ],
        "output": [
          "prod36"
        ],
        "name": "ReduceProd36",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col37"
        ],
        "output": [
          "prod37"
        ],
        "name": "ReduceProd37",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col38"
        ],
        "output": [
          "prod38"
        ],
        "name": "ReduceProd38",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col39"
        ],
        "output": [
          "prod39"
        ],
        "name": "ReduceProd39",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col40"
        ],
        "output": [
          "prod40"
        ],
        "name": "ReduceProd40",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col41"
        ],
        "output": [
          "prod41"
        ],
        "name": "ReduceProd41",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col42"
        ],
        "output": [
          "prod42"
        ],
        "name": "ReduceProd42",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col43"
        ],
        "output": [
          "prod43"
        ],
        "name": "ReduceProd43",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col44"
        ],
        "output": [
          "prod44"
        ],
        "name": "ReduceProd44",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col17"
        ],
        "output": [
          "prod17"
        ],
        "name": "ReduceProd17",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col18"
        ],
        "output": [
          "prod18"
        ],
        "name": "ReduceProd18",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col19"
        ],
        "output": [
          "prod19"
        ],
        "name": "ReduceProd19",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col20"
        ],
        "output": [
          "prod20"
        ],
        "name": "ReduceProd20",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col21"
        ],
        "output": [
          "prod21"
        ],
        "name": "ReduceProd21",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col22"
        ],
        "output": [
          "prod22"
        ],
        "name": "ReduceProd22",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col23"
        ],
        "output": [
          "prod23"
        ],
        "name": "ReduceProd23",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col24"
        ],
        "output": [
          "prod24"
        ],
        "name": "ReduceProd24",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col25"
        ],
        "output": [
          "prod25"
        ],
        "name": "ReduceProd25",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col26"
        ],
        "output": [
          "prod26"
        ],
        "name": "ReduceProd26",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col27"
        ],
        "output": [
          "prod27"
        ],
        "name": "ReduceProd27",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col28"
        ],
        "output": [
          "prod28"
        ],
        "name": "ReduceProd28",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col29"
        ],
        "output": [
          "prod29"
        ],
        "name": "ReduceProd29",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "col30"
        ],
        "output": [
          "prod30"
        ],
        "name": "ReduceProd30",
        "opType": "ReduceProd",
        "attribute": [
          {
            "name": "axes",
            "ints": [
              "1"
            ],
            "type": "INTS"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "prod64"
        ],
        "output": [
          "shape"
        ],
        "name": "N130",
        "opType": "Shape",
        "domain": ""
      },
      {
        "input": [
          "shape"
        ],
        "output": [
          "unit"
        ],
        "name": "N131",
        "opType": "ConstantOfShape",
        "attribute": [
          {
            "name": "value",
            "t": {
              "dims": [
                "1"
              ],
              "dataType": 1,
              "floatData": [
                1.0
              ],
              "name": "ONE"
            },
            "type": "TENSOR"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "unit",
          "prod",
          "prod1",
          "prod2",
          "prod3",
          "prod4",
          "prod5",
          "prod6",
          "prod7",
          "prod8",
          "prod9",
          "prod10",
          "prod11",
          "prod12",
          "prod13",
          "prod14",
          "prod15",
          "prod16",
          "prod17",
          "prod18",
          "prod19",
          "prod20",
          "prod21",
          "prod22",
          "prod23",
          "prod24",
          "prod25",
          "prod26",
          "prod27",
          "prod28",
          "prod29",
          "prod30",
          "prod31",
          "prod32",
          "prod33",
          "prod34",
          "prod35",
          "prod36",
          "prod37",
          "prod38",
          "prod39",
          "prod40",
          "prod41",
          "prod42",
          "prod43",
          "prod44",
          "prod45",
          "prod46",
          "prod47",
          "prod48",
          "prod49",
          "prod50",
          "prod51",
          "prod52",
          "prod53",
          "prod54",
          "prod55",
          "prod56",
          "prod57",
          "prod58",
          "prod59",
          "prod60",
          "prod61",
          "prod62",
          "prod63",
          "prod64"
        ],
        "output": [
          "variable1"
        ],
        "name": "Concat",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "variable1",
          "Su_Subcst"
        ],
        "output": [
          "Su_C0"
        ],
        "name": "Su_Sub",
        "opType": "Sub",
        "domain": ""
      },
      {
        "input": [
          "Su_C0",
          "Di_Divcst"
        ],
        "output": [
          "Di_C0"
        ],
        "name": "Di_Div",
        "opType": "Div",
        "domain": ""
      },
      {
        "input": [
          "Di_C0",
          "Ma_MatMulcst"
        ],
        "output": [
          "Ma_Y0"
        ],
        "name": "Ma_MatMul",
        "opType": "MatMul",
        "domain": ""
      },
      {
        "input": [
          "Ma_Y0",
          "Ad_Addcst"
        ],
        "output": [
          "variable"
        ],
        "name": "Ad_Add",
        "opType": "Add",
        "domain": ""
      }
    ],
    "name": "ONNX(Pipeline)",
    "initializer": [
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "0"
        ],
        "name": "comb"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "1"
        ],
        "name": "comb1"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "2"
        ],
        "name": "comb2"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "3"
        ],
        "name": "comb3"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "4"
        ],
        "name": "comb4"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "5"
        ],
        "name": "comb5"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "6"
        ],
        "name": "comb6"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "7"
        ],
        "name": "comb7"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "8"
        ],
        "name": "comb8"
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "int64Data": [
          "9"
        ],
        "name": "comb9"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "0"
        ],
        "name": "comb10"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "1"
        ],
        "name": "comb11"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "2"
        ],
        "name": "comb12"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "3"
        ],
        "name": "comb13"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "4"
        ],
        "name": "comb14"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "5"
        ],
        "name": "comb15"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "6"
        ],
        "name": "comb16"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "7"
        ],
        "name": "comb17"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "8"
        ],
        "name": "comb18"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "0",
          "9"
        ],
        "name": "comb19"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "1"
        ],
        "name": "comb20"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "2"
        ],
        "name": "comb21"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "3"
        ],
        "name": "comb22"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "4"
        ],
        "name": "comb23"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "5"
        ],
        "name": "comb24"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "6"
        ],
        "name": "comb25"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "7"
        ],
        "name": "comb26"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "8"
        ],
        "name": "comb27"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "1",
          "9"
        ],
        "name": "comb28"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "2"
        ],
        "name": "comb29"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "3"
        ],
        "name": "comb30"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "4"
        ],
        "name": "comb31"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "5"
        ],
        "name": "comb32"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "6"
        ],
        "name": "comb33"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "7"
        ],
        "name": "comb34"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "8"
        ],
        "name": "comb35"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "2",
          "9"
        ],
        "name": "comb36"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "3",
          "3"
        ],
        "name": "comb37"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "3",
          "4"
        ],
        "name": "comb38"
      },
      {
        "dims": [
          "2"
        ],
        "dataType": 7,
        "int64Data": [
          "3",
          "5"
        ],
        "name": "comb39"
